ahtn/keyplus/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Defs.h
// TMR5CN (Timer 5 Control)
#define SFR_TMR5CN 0xC8
SBIT (TMR5CN_T5XCLK,  SFR_TMR5CN, 0); ///< Timer 5 External Clock Select    
SBIT (TMR5CN_TR5,     SFR_TMR5CN, 2); ///< Timer 5 Run Control              
SBIT (TMR5CN_T5SPLIT, SFR_TMR5CN, 3); ///< Timer 5 Split Mode Enable        
SBIT (TMR5CN_TF5LEN,  SFR_TMR5CN, 5); ///< Timer 5 Low Byte Interrupt Enable
SBIT (TMR5CN_TF5L,    SFR_TMR5CN, 6); ///< Timer 5 Low Byte Overflow Flag   
SBIT (TMR5CN_TF5H,    SFR_TMR5CN, 7); ///< Timer 5 High Byte Overflow Flag  

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0  ///< External Interrupt 0        
#define TIMER0_IRQn  1  ///< Timer 0 Overflow            
#define INT1_IRQn    2  ///< External Interrupt 1        
#define TIMER1_IRQn  3  ///< Timer 1 Overflow            
#define UART0_IRQn   4  ///< UART 0                      
#define TIMER2_IRQn  5  ///< Timer 2 Overflow            
#define SPI0_IRQn    6  ///< SPI0                        
#define SMBUS0_IRQn  7  ///< SMBus 0                     
#define PMATCH_IRQn  8  ///< Port Match                  
#define ADC0WC_IRQn  9  ///< ADC0 Window Compare         
#define ADC0EOC_IRQn 10 ///< ADC0 End of Conversion      
#define PCA0_IRQn    11 ///< PCA0                        
#define CMP0_IRQn    12 ///< Comparator 0                
#define TIMER3_IRQn  14 ///< Timer 3 Overflow            
#define SMBUS1_IRQn  15 ///< SMBus 1                     
#define TIMER4_IRQn  16 ///< Timer 4 Overflow            
#define TIMER5_IRQn  17 ///< Timer 5 Overflow            
#define PTEMP0_IRQn  18 ///< Precision Temperature Sensor

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define IDAC0_PAGE     0x00 ///< IDAC0 Page                         
#define LEGACY_PAGE    0x00 ///< Legacy SFR Page                    
#define PTEMPDAT_PAGE  0x00 ///< Precision Temperature Sensor Data  
#define SMBUS0_PAGE    0x00 ///< SMBus 0 Page                       
#define TIMER2_PAGE    0x00 ///< Timer 2 Page                       
#define TIMER3_PAGE    0x00 ///< Timer 3 Page                       
#define CONFIG_PAGE    0x0F ///< System and Port Configuration Page 
#define IDAC1_PAGE     0x0F ///< IDAC1 Page                         
#define PTEMPCFG_PAGE  0x0F ///< Precision Temperature Sensor Config
#define SERIALNUM_PAGE 0x0F ///< Serial Number Page                 
#define SMBUS1_PAGE    0x0F ///< SMBus 1 Page                       
#define TIMER4_PAGE    0x0F ///< Timer 4 Page                       
#define TIMER5_PAGE    0x0F ///< Timer 5 Page                       

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F390_DEFS_H
//-eof--------------------------------------------------------------------------

